<script lang="ts">
</script>

<svelte:head>
	<title>Home</title>
	<meta name="description" content="ルール" />
</svelte:head>

<section>
	<h1>
        夜渡り鯖 ルール
	</h1>
    <h2>第0条 るーるがよめないこどもたちへ</h2>
    <p>この　るーるは　この　さーばーを　つかう　みんなに　まもって　ほしい　です。</p>
    <p>もし　あなたが　かんじや　にほんごが　よめないなら、　おうちの　ひとに　よんで　もらって　ください。</p>
    <h2 id="第1条-概要">第1条 概要</h2>
    <p>このルールはDiscordサーバー 夜渡り における基本的なルールをまとめたものです。必ず読み、理解してください。</p>
    <p><strong>このサーバーを利用した時点でこのルールに同意したものとします。</strong></p>
    <h2 id="第2条-あなたができること">第2条 あなたができること</h2>
    <ul>
    <li>あなたは当サーバーで<strong>日本国法及びDiscord利用規約を遵守して</strong>、自由に発言、VCの利用、フォーラムの利用等ができます。</li>
    </ul>
    <h2 id="第3条-あなたに求めること">第3条 あなたに求めること</h2>
    <ul>
    <li>
    <p>あなたは日本国法及びあなたが居住する国の法律を遵守しなければなりません。</p>
    </li>
    <li>
    <p>あなたはDiscordの利用規約に違反してはいけません。</p>
    </li>
    <li>
    <p>あなたは他者を思いやって発言及び行動をしなければなりません。</p>
    </li>
    <li>
    <p>あなたは投稿する内容に応じて投稿するチャンネルを分けなければなりません。</p>
    </li>
    <li>
    <p>あなたは運営の指示に従わなければなりません。</p>
    </li>
    </ul>
    <h2 id="第4条-あなたがしてはいけないこと">第4条 あなたがしてはいけないこと</h2>
    <ul>
    <li>
    <p>荒らし行為、引き抜き行為、宣伝行為は禁止します。</p>
    </li>
    <li>
    <p>その他、運営が不適切と判断した行為を禁止します。</p>
    </li>
    </ul>
    <h2 id="第5条-処罰方法">第5条 処罰方法</h2>
    <ul>
    <li>運営は、以上の要求を無視したり、禁止事項を行った人物に対して、口頭での注意、警告、タイムアウト、隔離、BAN等の処罰を行います。</li>
    </ul>
    <h2 id="第6条-ルールの変更">第6条 ルールの変更</h2>
    <ul>
    <li>運営は以下の場合には、鯖民の個別の同意を要せず、本ルールを変更することができるものとします。</li>
    </ul>
    <ol>
        <li>本ルールの変更が鯖民の一般の利益に適合するとき。</li>
        <li>本ルールの変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。</li>
    </ol>
    <ul>
    <li>運営は鯖民に対し、前項による本ルールの変更にあたり、事前に、本ルールを変更する旨及び変更後の本ルールの内容並びにその効力発生時期を通知します。</li>
    </ul>
</section>

<style>
	section {
		display: flex;
		flex-direction: column;
		justify-content: center;
		/* align-items: center; */
		flex: 0.6;
	}

	h1 {
		width: 100%;
	}

    :root {
        --color-page-bg-0: rgb(202, 216, 228);
	    --color-page-bg-1: hsl(209, 36%, 86%);
	    --color-page-bg-2: hsl(224, 44%, 95%);
	    --color-page-theme-1: #ff3e00;
	    --color-page-theme-2: #4075a6;
	    --color-page-text: rgba(0, 0, 0, 0.7);
    }
</style>